Tekla Open API Reference for Tekla Structures 2025
Events.ClashDetected Event
 The ClashDetected event is raised just after the detection of each clash. The clash information is saved before the event is triggered.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public event Events.ClashDetectedDelegate ClashDetected
Public Event ClashDetected As Events.ClashDetectedDelegate
Value
Type: Tekla.Structures.Model.Events.ClashDetectedDelegate
Implements
IEvents.ClashDetected
See Also
Reference
Events Class
Tekla.Structures.Model Namespace